In [ ]:
#Subquery - Query inside another query (When one question depends on another question)
#find avg salary filter emp where sal is greater than avg sal
#SELECT employee, salary From table1 where salary > (Select avg (salary) from table 1)
#START TRANSACTION (ALL OR NOTHING)
#SQL STATEMENT 1
#SQL STATEMENT 2
#SQL STATEMENT 3
#COMMIT(SAVE CHANGE)
#OR ROLLBACK
#A TRANSACTION IS A SEQUENCE OF SQL OPERATIONS EXECUTED AS A SINGLE UNIT WHERE EITHER ALL CHANGES ARE COMMITTED OR ALL ARE ROLLED BACK
#INDEXING : INDEX helps sql find data faster, just lke a book index or page number
#without index - Start from page 1 , read every page, very slow
#with index : go to index, directly jump there
#Create index idx_name on table1(name);

C:\Users\muska>mysql -u root -p
Enter password: **********
Welcome to the MySQL monitor.  Commands end with ; or \g.
Your MySQL connection id is 17
Server version: 8.0.44 MySQL Community Server - GPL

Copyright (c) 2000, 2025, Oracle and/or its affiliates.

Oracle is a registered trademark of Oracle Corporation and/or its
affiliates. Other names may be trademarks of their respective
owners.

Type 'help;' or '\h' for help. Type '\c' to clear the current input statement.

mysql> USE school;
Database changed
mysql> SHOW databases;
+--------------------+
| Database           |
+--------------------+
| information_schema |
| mysql              |
| performance_schema |
| school             |
| student            |
| sys                |
+--------------------+
6 rows in set (0.22 sec)


mysql> SELECT * FROM employees;
+--------+----------+------------+--------+-----------+--------+------------+
| emp_id | emp_name | department | gender | city      | salary | experience |
+--------+----------+------------+--------+-----------+--------+------------+
|      1 | Rahul    | IT         | Male   | Delhi     |  70000 |          5 |
|      2 | Anita    | HR         | Female | Mumbai    |  50000 |          4 |
|      3 | Aman     | IT         | Male   | Delhi     |  90000 |          8 |
|      4 | Neha     | Finance    | Female | Pune      |  60000 |          6 |
|      5 | Rohit    | IT         | Male   | Mumbai    |  75000 |          5 |
|      6 | Priya    | HR         | Female | Delhi     |  48000 |          3 |
|      7 | Vikas    | Finance    | Male   | Pune      |  65000 |          7 |
|      8 | Sneha    | IT         | Female | Bangalore |  85000 |          6 |
|      9 | Arjun    | HR         | Male   | Mumbai    |  52000 |          4 |
|     10 | Kavya    | Finance    | Female | Delhi     |  72000 |          8 |
+--------+----------+------------+--------+-----------+--------+------------+
10 rows in set (0.01 sec)

mysql> SELECT emp_name, salary
    -> FROM employees
    -> WHERE salary > (
    -> SELECT AVG(salary)
    -> FROM employees
    -> );
+----------+--------+
| emp_name | salary |
+----------+--------+
| Rahul    |  70000 |
| Aman     |  90000 |
| Rohit    |  75000 |
| Sneha    |  85000 |
| Kavya    |  72000 |
+----------+--------+
5 rows in set (0.01 sec)

mysql> SELECT customer_name
    -> FROM customers c
    -> WHERE EXISTS (
    ->     SELECT 1
    ->     FROM orders o
    ->     WHERE o.customer_id = c.customer_id
    -> );
+---------------+
| customer_name |
+---------------+
| Aman          |
| Riya          |
| Kabir         |
| Arjun         |
| Simran        |
| Rahul         |
+---------------+
6 rows in set (0.04 sec)

mysql> SELECT customer_name from customers where customer_id in (select customer_id from orders);
+---------------+
| customer_name |
+---------------+
| Aman          |
| Riya          |
| Kabir         |
| Arjun         |
| Simran        |
| Rahul         |
+---------------+
6 rows in set (0.00 sec)

mysql> SELECT customer_name from customers where customer_id not in (select customer_id from orders);
+---------------+
| customer_name |
+---------------+
| Neha          |
| Pooja         |
| Vikas         |
| Anita         |
+---------------+
4 rows in set (0.01 sec)

mysql> SELECT customer_name
    -> FROM customers
    -> WHERE customer_id IN(
    -> SELECT customer_id
    -> FROM orders
    -> WHERE amount > (
    -> SELECT AVG(amount)
    -> FROM orders
    -> )
    -> );
+---------------+
| customer_name |
+---------------+
| Aman          |
| Riya          |
| Simran        |
| Rahul         |
+---------------+
4 rows in set (0.03 sec)

mysql> CREATE TABLE bank_accounts(
    -> acc_id INT,
    -> acc_name VARCHAR(50),
    -> balance INT
    -> );
Query OK, 0 rows affected (0.16 sec)

mysql> insert into bank_accounts values
    -> (1,"rahul",5000),
    -> (2,"Neha",3000);
Query OK, 2 rows affected (0.04 sec)
Records: 2  Duplicates: 0  Warnings: 0

mysql> update bank_accounts set balance=balance-500 where acc_id = 1;
Query OK, 1 row affected (0.03 sec)
Rows matched: 1  Changed: 1  Warnings: 0

mysql> START TRANSACTION;
Query OK, 0 rows affected (0.02 sec)

mysql> update bank_accounts set balance = balance + 1000 WHERE acc_name = 'Neha';
Query OK, 1 row affected (0.02 sec)
Rows matched: 1  Changed: 1  Warnings: 0

mysql> COMMIT;
Query OK, 0 rows affected (0.03 sec)

mysql> select * from customers;
+-------------+---------------+-----------+
| customer_id | customer_name | city      |
+-------------+---------------+-----------+
|           1 | Aman          | Delhi     |
|           2 | Riya          | Mumbai    |
|           3 | Kabir         | Delhi     |
|           4 | Neha          | Pune      |
|           5 | Arjun         | Bangalore |
|           6 | Simran        | Mumbai    |
|           7 | Rahul         | Delhi     |
|           8 | Pooja         | Chennai   |
|           9 | Vikas         | Pune      |
|          10 | Anita         | Bangalore |
+-------------+---------------+-----------+
10 rows in set (0.00 sec)

mysql> create index idx_name on customers(customer_name);
Query OK, 0 rows affected (0.15 sec)
Records: 0  Duplicates: 0  Warnings: 0

mysql> select * from customers where customer_name = "Anita";
+-------------+---------------+-----------+
| customer_id | customer_name | city      |
+-------------+---------------+-----------+
|          10 | Anita         | Bangalore |
+-------------+---------------+-----------+
1 row in set (0.00 sec)

mysql> create index idx_id on customers(customer_id);
Query OK, 0 rows affected (0.07 sec)
Records: 0  Duplicates: 0  Warnings: 0

mysql> SELECT * FROM customers WHERE customer_id = 7;
+-------------+---------------+-------+
| customer_id | customer_name | city  |
+-------------+---------------+-------+
|           7 | Rahul         | Delhi |
+-------------+---------------+-------+
1 row in set (0.00 sec)

mysql> select * from orders;
+----------+-------------+-----------+--------+
| order_id | customer_id | product   | amount |
+----------+-------------+-----------+--------+
|      101 |           1 | Laptop    |  60000 |
|      102 |           1 | Mouse     |   1500 |
|      103 |           2 | Mobile    |  30000 |
|      104 |           3 | Keyboard  |   2500 |
|      105 |           3 | Monitor   |  12000 |
|      106 |           5 | Tablet    |  20000 |
|      107 |           6 | Laptop    |  65000 |
|      108 |           7 | Mobile    |  28000 |
|      109 |           7 | Earphones |   2000 |
|      110 |          11 | Camera    |  40000 |
+----------+-------------+-----------+--------+
10 rows in set (0.00 sec)

mysql> SELECT *
    -> FROM orders
    -> WHERE product = 'Earphones';
+----------+-------------+-----------+--------+
| order_id | customer_id | product   | amount |
+----------+-------------+-----------+--------+
|      109 |           7 | Earphones |   2000 |
+----------+-------------+-----------+--------+
1 row in set (0.00 sec)

mysql> CREATE INDEX idx_product
    -> ON orders(product);
Query OK, 0 rows affected (0.08 sec)
Records: 0  Duplicates: 0  Warnings: 0

mysql> SELECT *
    -> FROM orders
    -> WHERE product = 'Earphones';
+----------+-------------+-----------+--------+
| order_id | customer_id | product   | amount |
+----------+-------------+-----------+--------+
|      109 |           7 | Earphones |   2000 |
+----------+-------------+-----------+--------+
1 row in set (0.00 sec)

mysql> SELECT * FROM ORDERS WHERE PRODUCT = 'Earphones';
+----------+-------------+-----------+--------+
| order_id | customer_id | product   | amount |
+----------+-------------+-----------+--------+
|      109 |           7 | Earphones |   2000 |
+----------+-------------+-----------+--------+
1 row in set (0.00 sec)

mysql> ALTER TABLE orders ADD age INT;
Query OK, 0 rows affected (0.05 sec)
Records: 0  Duplicates: 0  Warnings: 0

mysql> select * from orders;
+----------+-------------+-----------+--------+------+
| order_id | customer_id | product   | amount | age  |
+----------+-------------+-----------+--------+------+
|      101 |           1 | Laptop    |  60000 | NULL |
|      102 |           1 | Mouse     |   1500 | NULL |
|      103 |           2 | Mobile    |  30000 | NULL |
|      104 |           3 | Keyboard  |   2500 | NULL |
|      105 |           3 | Monitor   |  12000 | NULL |
|      106 |           5 | Tablet    |  20000 | NULL |
|      107 |           6 | Laptop    |  65000 | NULL |
|      108 |           7 | Mobile    |  28000 | NULL |
|      109 |           7 | Earphones |   2000 | NULL |
|      110 |          11 | Camera    |  40000 | NULL |
+----------+-------------+-----------+--------+------+
10 rows in set (0.00 sec)
SQL COMMANDS ARE DIVIDED INTO 5 TYPES:

1. DATA DEFINITION LANGUAGE (DDL): STRUCTURE (DESIGN)
   - CREATE
   - ALTER
   - DROP
   - RENAME
   - TRUNCATE

2. DATA MANIPULATION LANGUAGE (DML): DATA (ROWS)
   - INSERT
   - UPDATE
   - DELETE

3. DATA QUERY LANGUAGE (DQL): FETCH DATA
   - SELECT

4. DATA CONTROL LANGUAGE (DCL): SECURITY
   - GRANT
     SYNTAX-> GRANT SELECT ON customers TO user1;

   - REVOKE
     SYNTAX-> REVOKE SELECT ON customers TO user1;

5. TRANSACTION CONTROL LANGUAGE (TCL): TRANSACTIONS
   - SAVEPOINT
   - COMMIT
   - ROLLBACK

NORMALIZATION:
MAKING A MESSY LONG TABLE TO INTO A CLEAN, ORGANIZED AND GOOD TABLE IS NORMALIZATION.

WHY NORMALIZATION?
 - DATA DUPLICATION
 - INSERT ANOMALY
 - UPDATE ANOMALY
 - DELETE ANOMALY
 mysql> CREATE TABLE employees (
    ->     emp_id INT PRIMARY KEY,
    ->     emp_name VARCHAR(50),
    ->     department VARCHAR(50)
    -> );
Query OK, 0 rows affected (0.03 sec)

mysql>
mysql> INSERT INTO employees VALUES
    -> (1,'Rahul','IT'),
    -> (2,'Neha','HR'),
    -> (3,'Amit','IT'),
    -> (4,'Priya','Finance'),
    -> (5,'Karan','HR');
Query OK, 5 rows affected (0.01 sec)
Records: 5  Duplicates: 0  Warnings: 0

mysql> CREATE TABLE projects (
    ->     project_id INT PRIMARY KEY,
    ->     project_name VARCHAR(50),
    ->     budget INT
    -> );
Query OK, 0 rows affected (0.06 sec)

mysql>
mysql> INSERT INTO projects VALUES
    -> (101,'Website Revamp',100000),
    -> (102,'Mobile App',150000),
    -> (103,'Payroll System',80000);
Query OK, 3 rows affected (0.01 sec)
Records: 3  Duplicates: 0  Warnings: 0

mysql> CREATE TABLE employee_projects (
    ->     emp_id INT,
    ->     project_id INT,
    ->     hours_worked INT,
    ->     FOREIGN KEY (emp_id) REFERENCES employees(emp_id),
    ->     FOREIGN KEY (project_id) REFERENCES projects(project_id)
    -> );
Query OK, 0 rows affected (0.10 sec)

mysql>
mysql> INSERT INTO employee_projects VALUES
    -> (1,101,40),
    -> (1,102,30),
    -> (2,103,20),
    -> (3,101,50),
    -> (3,102,25),
    -> (4,103,35),
    -> (5,103,30);
Query OK, 7 rows affected (0.02 sec)
Records: 7  Duplicates: 0  Warnings: 0

mysql> SELECT * FROM employees;
+--------+----------+------------+
| emp_id | emp_name | department |
+--------+----------+------------+
|      1 | Rahul    | IT         |
|      2 | Neha     | HR         |
|      3 | Amit     | IT         |
|      4 | Priya    | Finance    |
|      5 | Karan    | HR         |
+--------+----------+------------+
5 rows in set (0.00 sec)

mysql> SELECT * FROM projects;
+------------+----------------+--------+
| project_id | project_name   | budget |
+------------+----------------+--------+
|        101 | Website Revamp | 100000 |
|        102 | Mobile App     | 150000 |
|        103 | Payroll System |  80000 |
+------------+----------------+--------+
3 rows in set (0.00 sec)

mysql> SELECT * FROM employee_projects;
+--------+------------+--------------+
| emp_id | project_id | hours_worked |
+--------+------------+--------------+
|      1 |        101 |           40 |
|      1 |        102 |           30 |
|      2 |        103 |           20 |
|      3 |        101 |           50 |
|      3 |        102 |           25 |
|      4 |        103 |           35 |
|      5 |        103 |           30 |
+--------+------------+--------------+
7 rows in set (0.00 sec)

mysql> SELECT e.emp_id, e.emp_name, SUM(ep.hours_worked) AS total_hours
    -> FROM employees e
    -> JOIN employee_projects ep
    -> ON e.emp_id = ep.emp_id
    -> GROUP BY e.emp_id, e.emp_name;
+--------+----------+-------------+
| emp_id | emp_name | total_hours |
+--------+----------+-------------+
|      1 | Rahul    |          70 |
|      2 | Neha     |          20 |
|      3 | Amit     |          75 |
|      4 | Priya    |          35 |
|      5 | Karan    |          30 |
+--------+----------+-------------+
5 rows in set (0.00 sec)

mysql> SELECT p.project_id, p.project_name, SUM(ep.hours_worked) AS total_hours
    -> FROM projects p
    -> JOIN employee_projects ep
    -> ON p.project_id = ep.project_id
    -> GROUP BY p.project_id, p.project_name;
+------------+----------------+-------------+
| project_id | project_name   | total_hours |
+------------+----------------+-------------+
|        101 | Website Revamp |          90 |
|        102 | Mobile App     |          55 |
|        103 | Payroll System |          85 |
+------------+----------------+-------------+
3 rows in set (0.00 sec)

mysql> SELECT e.department, SUM(ep.hours_worked) AS total_hours
    -> FROM employees e
    -> JOIN employee_projects ep
    -> ON e.emp_id = ep.emp_id
    -> GROUP BY e.department;
+------------+-------------+
| department | total_hours |
+------------+-------------+
| IT         |         145 |
| HR         |          50 |
| Finance    |          35 |
+------------+-------------+
3 rows in set (0.00 sec)